cask_args appdir: '/Applications'

tap 'caskroom/cask'

brew 'vim'
brew 'git'
brew 'tree'
brew 'fasd'
brew 'mongodb'
brew 'heroku'
brew 'imagemagick'
brew 'postgresql'
brew 'ffmpeg'
brew 'gifsicle'
brew 'the_silver_searcher'
brew 'diff-so-fancy'
brew 'node'
brew 'rbenv'

tap 'caskroom/versions'
tap 'caskroom/fonts'

# quicklook plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzipql'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'
cask 'quicklookase'
cask 'qlvideo'

cask 'dropbox'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'firefox'
cask 'spotify'
cask 'caffeine'
cask 'little-snitch'
cask 'hipchat'
cask 'skype'
cask 'the-unarchiver'
cask 'github-desktop'
cask 'transmission'
cask 'iterm2'
cask 'datagrip'
cask 'forklift'
cask '1password'

cask 'sublime-text'
cask 'macvim'

cask 'xquartz'

# fonts
cask 'font-roboto'
cask 'font-open-sans'
cask 'font-source-sans-pro'
cask 'font-bree-serif'
cask 'font-hack'
cask 'font-roboto-mono'
