cask_args appdir: '/Applications'

tap 'caskroom/cask'

brew 'vim'
brew 'git'
brew 'tree'
brew 'fasd'
brew 'trash'
brew 'the_silver_searcher'
brew 'diff-so-fancy'
brew 'node'
brew 'rbenv'
brew 'dark-mode'

tap 'caskroom/versions'
tap 'caskroom/fonts'

# quicklook plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'
cask 'quicklookase'
cask 'qlvideo'

cask 'karabiner-elements'
cask 'hammerspoon'
cask 'dropbox'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'firefox'
cask 'spotify'
cask 'little-snitch'
cask 'skype'
cask 'the-unarchiver'
cask 'github'
cask 'iterm2'
cask 'datagrip'
cask 'forklift'
cask '1password'
cask 'keepingyouawake'
cask 'daisydisk'
cask 'bartender'
cask 'sublime-text'
cask 'slack'

# fonts
cask 'font-roboto'
cask 'font-open-sans'
cask 'font-source-sans-pro'
cask 'font-bree-serif'
cask 'font-hack'
cask 'font-roboto-mono'
