cask_args appdir: '/Applications'

tap 'homebrew/cask'

brew 'vim'
brew 'git'
brew 'tree'
brew 'fasd'
brew 'fzf'
brew 'trash'
brew 'the_silver_searcher'
brew 'diff-so-fancy'
brew 'node'
brew 'yarn'

cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlimagesize'
cask 'suspicious-package'
cask 'apparency'
cask 'quicklookase'
cask 'qlvideo'

cask 'karabiner-elements'
cask 'hammerspoon'
cask 'google-chrome'
cask 'spotify'
cask 'github'
cask 'iterm2'
cask '1password'
cask 'keepingyouawake'
cask 'sublime-text'
cask 'slack'
cask 'soulver'
